# GridlineAxisTooFar Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GridFailures..::..GridlineAxisTooFar Property
BuiltInFailures..::..GridFailures Class See Also
---
Axis of gridlines should not be further than [Value] to each other.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GridlineAxisTooFar { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridlineAxisTooFar As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GridlineAxisTooFar {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GridFailures Class
Autodesk.Revit.DB Namespace